OdGePoint3d.swapWithPoint(OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Swaps coordinates of this point and the specified point.
\param point [in]  A 3D point's coordinates which are swapped with coordinates of this point.

OdGePoint3d.set(OdGePlanarEnt!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the parameters for this point according to the arguments
\param plane [in]  Any plane.
\param point [in]  Any 2D point.
\remarks
Returns a reference to this point.
\remarks
plane and pnt2d define a point as follows:
p + uAxis * point.x + vAxis * point.y,
where p, uAxis, and vAxis are returned by the function call plane.get (p, uAxis, vAxis);

OdGePoint3d.set(OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double)
\details
Sets the parameters for this point according to the arguments.
\param xy [in]  A 2D point that provides the X and Y coordinates for this point.
\param zz [in]  The Z-coordinate of this point.

OdGePoint3d.set(System.Double,System.Double,System.Double)
\details
Sets the parameters for this point according to the arguments
\param xx [in]  The X-coordinate of this point.
\param yy [in]  The Y-coordinate of this point.
\param zz [in]  The Z-coordinate of this point.

OdGePoint3d.op_Subscript(System.UInt32)
\details
Returns ith coordinate of this point.
\param i [in]  Index of coordinate.
\remarks
* 0 returns the X-coordinate.
* 1 returns the Y-coordinate.
* 2 returns the Z-coordinate.
\details
References ith coordinate of this point.
\param i [in]  Index of coordinate.
\remarks
* 0 references the X-coordinate.
* 1 references the Y-coordinate.
* 2 references the Z-coordinate.

OdGePoint3d.isEqualTo(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the distance from this point to point is within the
specified tolerance.
\param point [in]  Any 3D point.
\param tol [in]  Geometric tolerance.

OdGePoint3d.op_Inequality(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Inequality operator. Returns true if any of the coordinates of this point are not equal to the corresponding coordinates
of the specified point.
\param point [in] A 3D point to be checked for inequality with this point.

OdGePoint3d.op_Equality(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Equality operator. Returns true if all the coordinates of this point are equal to the corresponding coordinates
of the specified point.
\param point [in] A 3D point to be checked for equality with this point.

OdGePoint3d.orthoProject(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the 3D point that is the result of the orthogonal projection of this point into the specified plane.
\param plane [in]  Plane on which this point is to be projected

OdGePoint3d.project(OdGePlanarEnt!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Projects this point onto the specified plane along the specified vector.
\param plane [in]  Plane on which this point is to be projected
\param vect [in]  Vector defining the projection direction.

OdGePoint3d.distanceSqrdTo(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the squared distance from this point to the specified point.
\param point [in]  Any 3D point to which a squared distance is measured.

OdGePoint3d.distanceTo(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the distance from this point to the specified point.
\param point [in]  Any 3D point to which a distance is measured.

OdGePoint3d.asVector
\details
Returns this point as a vector.
\details
Returns this point as a vector.

OdGePoint3d.op_Subtraction(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Subtraction operator for the OdGePoint3d class.
\param point [in]  Input 3D point, coordinates of which are subtracted from the coordinates of this point.
\remarks
Returns a vector formed as a result of this point's coordinates minus coordinates of the specified point.

OdGePoint3d.setToSum(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this point to point + vect, and returns a reference to this point.
\param point [in]  Any 3D point.
\param vect [in]  Any 3D vector.

OdGePoint3d.op_SubtractionAssignment(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Subtraction operator for the OdGePoint3d class.
\param vect [in]  Input vector by which a point is translated.
\remarks
Returns a reference to the point equal to this point translated by the vector opposite to the specified vector.

OdGePoint3d.op_Subtraction(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Subtraction operator for the OdGePoint3d class.
\param vect [in]  Input vector by which a point is translated.
\remarks
Returns a point that is translated in the opposite direction and length of the specified input vector.

OdGePoint3d.op_AdditionAssignment(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Addition operator for the OdGePoint3d class.
\param vect [in]  Input vector by which a point is translated.
\remarks
Returns a reference to a point that is translated by the specified input vector.

OdGePoint3d.op_Addition(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Addition operator for the OdGePoint3d class.
\param vect [in]  Input vector by which a point is translated.
\remarks
Translates this point by the specified vector.

OdGePoint3d.op_DivisionAssignment(System.Double)
\details
Division operator for the OdGePoint3d class.
\param scale [in]  Input scale factor.
\remarks
Returns a reference to a point that is the result of scaling this point with respect to the origin by a scale factor.

OdGePoint3d.op_Division(System.Double)
\details
Division operator for the OdGePoint3d class.
\param scale [in]  Input scale factor.
\remarks
Returns the point equal to this point scaled by a scale factor 1/scale.

OdGePoint3d.op_MultiplicationAssignment(System.Double)
\details
Multiplication operator for the OdGePoint3d class.
\param scale [in]  Input scale factor.
\remarks
Scales this point by a scale factor. Returns the reference to this point.

OdGePoint3d.op_Multiply(System.Double)
\details
Multiplication operator for the OdGePoint3d class.
\param scale [in]  Input scale factor.
\remarks
Makes this point equal to the point scaled by a scale factor.

OdGePoint3d.convert2d
\details
Returns the 2D point from this point discarding the Z-coordinate.

OdGePoint3d.convert2d(OdGePlanarEnt!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the 2D point with the coordinates corresponding to the decomposition of the vector * this - p in the basis uAxis,
vAxis of the planar entity, where p, uAxis, and vAxis can be found by the function call plane.get(p, uAxis, vAxis).
\param plane [in]  A plane on which this point lies.
\remarks
This 3D point is assumed to be on the specified plane.

OdGePoint3d.scaleBy(System.Double,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Scales this point by the scale factor about the basepoint.
\param scaleFactor [in]  Scale Factor. The scale factor must be greater than zero.
\param basePoint [in]  Basepoint relative to which scaling is computed.

OdGePoint3d.mirror(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Mirrors this point about the specified plane.
\param plane [in]  Mirror plane.

OdGePoint3d.rotateBy(System.Double,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Rotates this point about the specified basePoint and axis of rotation by the specified angle.
\param angle [in]  Rotation angle in radians.
\param vect [in]  Axis of rotation.
\param basePoint [in]  Basepoint relative to which rotation is computed.

OdGePoint3d.transformBy(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGe.ErrorCondition*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this point to the result of the matrix multiplication of xfm * this point.
Returns a reference to this point.
\param xfm [in]  A 3D matrix with which this point is multiplied.
\param status [out]  Receives the status of transformation.
\remarks
On some xfm matrices with non-empty perspective transformation the result may be
undefined, in such cases this point is unchanged, and k0This is returned in status.
Possible values for status are as follows:
@untitled table
kOk
k0This

OdGePoint3d.transformBy(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this point to the result of the matrix multiplication of xfm * this point.
Returns a reference to this point.
\param xfm [in]  A 3D matrix with which this point is multiplied.

OdGePoint3d.setToProduct(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this point to the product of xfm * point, and returns a reference to this point.
\param xfm [in]  A 3D matrix with which a specified point is multiplied.
\param point [in]  The point to be multiplied.

OdGePoint3d.op_Multiply(System.Double,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\remarks
Sets this point to the result of the matrix multiplication of the point and a scale factor.
\param scale [in]  Scale factor.
\param point [in]  The point to be multiplied.

OdGePoint3d.#ctor(OdGePlanarEnt!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor for the OdGePoint3d class.
\param plane [in]  Any planar entity.
\param pnt2d [in]  2D parameter in a plane's coordinates.
\remarks
Constructs a 3D point by the formula:
p + uAxis * pnt2d.x + vAxis * pnt2d.y,
where p, uAxis, and vAxis are returned by the function call plane.get (p, uAxis, vAxis);

OdGePoint3d.#ctor(System.Double,System.Double,System.Double)
\details
Constructor for the OdGePoint3d class.
\param xx [in]  The X-coordinate of this point.
\param yy [in]  The Y-coordinate of this point.
\param zz [in]  The Z-coordinate of this point.
\remarks
Constructs a 3D point with specified coordinates.

OdGePoint3d.#ctor
\details
Default constructor for the OdGePoint3d class.
\remarks
The default constructor constructs a point at the origin.